[
    {
        "name": "Þorvarður Helgi Bjarnason",
        "title": "Forritari / Húsasmiður",
        "age": 24,
        "email": "thorrib@live.com",
        "phone": "(+354) 772 2112",
        "location": "Reykjavík, Ísland",
        "linkedin": "https://www.linkedin.com/in/thorvardurhelgi/",
        "github": "https://github.com/GiantMushy",
        "aboutMe": "Í sumar er ég búinn að vera vinna í hugbúnaðarþróun hjá Kóða ehf á sumarráðningarsamning að uppfæra vefsíðuna þeirra Hluthafaskra.is. Í vetur mun ég vera að klára seinasta ár mitt í Tölvunarfræði í Háskólanum í Reykjavík.\n Ég var á forsetalistanum á Vorönn 2024, hef verið dæmatímakennari síðan janúar 2025, og var í  starfsnámi hjá Kóða á vorönn 2025. \n Ég hef víðtæka reynslu á mismunandi vinnustöðum og verkefnum, en hef algjörlega fundið áhugasviðið mitt í tölvunarfræinni. Ég hlakka til að takast á við hvaða verkefni sem mér er falið, og mun leggja mig allan fram við að ná árangri við það, eins og ég hef gert í skólanum. Hægt er að skoða nokkur skólaverkefni og verkefni sem ég gerði sjálfur í sumarfríum mínum árin 2021-2024 á GitHub síðunni minni (undir Tengiliðir).",
        "moreAboutMe": "Python (5+ ár) - Mesta forritunarreynslan mín er í Python. Ég er búinn með samtals 6 áfanga sem hafa snúist um mismunandi notkunir á Python. Ég vil leggja sérstaka áherslu á NanAir, verkefni sem ég gerði í fyrsta þriggja vikna áfanganum, og finna má á GitHub síðunni minni. Hér bjuggum við til skipulagningarforrit fyrir gerfi-flugfélagið „NanAir". Við vorum eini hópurinn í árgangnum til að fá 10 fyrir verkefnið.\n Vefforritun (3+ ár) - Hjá Kóða vann ég við þróun á veflausnum fyrir Hluthafaskrá.is í 8 mánuði, þar sem ég bæti við nýrri virkni og bæti notendaupplifun. Verkefnin hafa felið í sér bæði bakendaþróun í .NET (SQL gagnagrunni) og framenda með Razor-síðum í CS og JavaScript. Auk þess hef ég tekið 3 áfanga sem fjölluðu um vefforritun.\n Önnur tungumál - Ég hef lokið áföngum sem kenndu mér grunnatriði í: Java, C++, C#, DrRacket, smalltalk, MatLab, R, og fleirra.\n Samvinna – Það hefur verið ómetanlegt að fá að vinna með nýju fólki, bæði í HR og hjá Kóða, því mér hefur alltaf tekist að læra eitthvað nýtt af þeim, auk þess sem það gerir lífið skemmtilegra. Framfarir mínar og árangur í náminu undafarið ár má að mörgu leiti rekja til tengsla sem ég hef myndað í skólanum.  Ég legg mikla áherslu á að fá hópinn til að vinna vel saman í öllum þeim hópverkefnum sem ég fæ að taka þátt í, og tel góða samvinnu vera einn af mínum bestu eiginleikum."
    }
]
